#include "stdafx.h"
#include <iostream>

//=========================================================================================================================
// 1.Создать и инициализировать переменные пройденных типов данных (short int, int, long long, char, bool, float, double).
//=========================================================================================================================
short int myShortInteger = 42;
int myInteger = -30'0000;
long long myLong = 1'000'000'000;
char myChar = 'A';
bool myBool = true;
float myFloat = 3.11;
double myDouble = 1.44;


//=========================================================================================================================
// 2.Создать перечисление (enum) с возможными вариантами символов для игры в крестики-нолики.
//=========================================================================================================================

enum TicTacToeCell {
	TC_EMPTY = '_',
	TC_CROSS = 'X',
	TC_ZERO = '0'
};

//=========================================================================================================================
// 3.Создать массив, способный содержать значения такого перечисления и инициализировать его.
//=========================================================================================================================
TicTacToeCell array[3][3] = { {TC_EMPTY, TC_EMPTY, TC_EMPTY},
							  {TC_EMPTY, TC_EMPTY, TC_EMPTY},
							  {TC_EMPTY, TC_EMPTY, TC_EMPTY}
};

//=========================================================================================================================
// 4. Создать структуру(struct) данных «Поле для игры в крестики - нолики» и снабдить его всеми необходимыми свойствами
//=========================================================================================================================
struct TicTacToe {
	TicTacToeCell array[3][3]; // array of cells;
	bool isGameFinished;
	bool isFirstPlayerWon;
	long long Player1ID, Player2ID;
	TicTacToeCell ePlayer1, ePlayer2;
	const unsigned int nFieldSize = 3;
};

//=========================================================================================================================
// 5. Создать структуру (struct) объединяющую: union (int, float, char) и 3-и битовых поля (флага) указывающими какого типа 
//    значение в данный момент содержится в объединении (isInt, isFloat, isChar).
//=========================================================================================================================


union MyVariantData {
	int MyInt;
	float MyFloat;
	char MyChar;
};

struct MyVariant {
	MyVariantData data;

	unsigned int isChar : 1;
	unsigned int isFloat : 1;
	unsigned int isInt : 1;
};


int main()
{
	MyVariant var;


	// for integer
	var.data.MyInt = 1;
	var.isChar = 0;
	var.isFloat = 0;
	var.isInt = 1;

	//for float
	var.data.MyFloat = 99.9;
	var.isChar = 0;
	var.isFloat = 1;
	var.isInt = 0;

	//for char
	var.data.MyChar= 'A';
	var.isChar = 1;
	var.isFloat = 0;
	var.isInt = 0;

	return 0;
}