#include <iostream>
#include <fstream>

//=========================================================================================================================
// 1. Выделить в памяти динамический одномерный массив типа int. Размер массива запросить у пользователя. 
// Инициализировать его числами степенями двойки: 1, 2, 4, 8, 16, 32, 64, 128 … 
// Вывести массив на экран. Не забыть освободить память. =) Разбить программу на функции.
//=========================================================================================================================

void inline task1()
{
	size_t n = 0;
	std::cin >> n;
	int* pArr = new int[n];
	pArr[0] = 1;
	for (size_t i = 1; i < n; i++)
	{
		pArr[i] = pArr[i - 1] * 2;
	}
	for (size_t i = 0; i < n; i++)
	{
		std::cout << pArr[i] << " ";
	}
	std::cout << std::endl;
	delete[] pArr;
	pArr = nullptr;
}

//=========================================================================================================================
// 2. Динамически выделить матрицу 4х4 типа int. Инициализировать ее псевдослучайными числами через функцию rand. 
// Вывести на экран. Разбейте вашу программу на функции которые вызываются из main.
//=========================================================================================================================

void inline task2()
{
	srand(time(NULL));
	const size_t SIZE = 4;
	int** ppArr = new int* [SIZE];

	for (int i = 0; i < SIZE; i++)
	{
		ppArr[i] = new int[SIZE];
	}

	for (int i = 0; i < SIZE; i++)
	{
		for (int j = 0; j < SIZE; j++)
		{
			ppArr[i][j] = rand();
		}
	}


	for (int i = 0; i < SIZE; i++)
	{
		for (int j = 0; j < SIZE; j++)
		{
			std::cout << ppArr[i][j] << " ";
		}
		std::cout << std::endl;
	}


	for (int i = 0; i < SIZE; i++)
	{
		delete [] ppArr[i];
	}
	ppArr = nullptr;

}

//=========================================================================================================================
// 3. Написать программу c 2-я функциями, которая создаст два текстовых файла (*.txt), 
// примерно по 50-100 символов в каждом (особого значения не имеет с каким именно содержимым). 
// Имена файлов запросить у польлзователя.
//=========================================================================================================================

void inline createRandomFile(std::string name)
{
	std::ofstream fout(name);
	for (size_t i = 0; i < 50; i++)
	{
		fout << rand();
	}
	fout.close();
}

void inline task3()
{
	std::string fileName1, fileName2;
	std::cin >> fileName1;
	std::cin >> fileName2;
	fileName1 += ".txt";
	fileName2 += ".txt";
	createRandomFile(fileName1);
	createRandomFile(fileName2);
}


int main() 
{
	task1();
	task2();
	task3();
	return 0;
}