#include "stdafx.h"
#include <iostream>

//=========================================================================================================================
// 1(4). Написать программу, вычисляющую выражение a * (b + (c / d)) и выводящую результат с плавающей точкой, 
// где a, b, c, d – целочисленные константы. Используйте static_cast или СStyle cast к float чтобы выполнить точное деление.
//=========================================================================================================================

extern int a;
extern int b;
extern int c;
extern int d;

float task1_result = a * (b + static_cast<float>(c) / d);

//=========================================================================================================================
// 2. Дано целое число.Если оно меньше или равно 21, то выведите на экран разницу между этим числом и числом 21. Если же 
// заданное число больше, чем 21, необходимо вывести удвоенную разницу между этим числом и 21. При выполнении задания 
// следует использовать тернарный оператор(? : ).
//=========================================================================================================================

const int someInt = 22;
int task2_result = (someInt <= 21) ? someInt - 21 : 2 * (someInt - 21);

//=========================================================================================================================
// 3. Описать трёхмерный целочисленный массив, размером 3х3х3 и указатель на значения внутри массива и при помощи операции 
// разыменования вывести на экран значение центральной ячейки получившегося куба[1][1][1].
//=========================================================================================================================

int myArray[3][3][3];
int *ptr = &myArray[1][1][1];

int main()
{
	*ptr = 42;
	std::cout << myArray[1][1][1] << std::endl;
	return 0;
}

